{
  "articles": [
    {
      "id": "what-technologies-should-you-be-using",
      "title": "What technologies we use?",
      "date": "March 26, 2021",
      "imgSrc": "/image/article-26-03-2021.jpeg",
      "summary": "Doesn't matter if you are in health tech, fintech, e-commerce, or blockchain. There'll be a time you will need to define what technology",
      "content": "<p>Doesn't matter if you are in health tech, fintech, e-commerce, or blockchain. There'll be a time you will need to define what technology you will use to build your business. Following trends and superficial advices might cost you thousands of dollars later on. So, which one should you pick?</p><p>Currently, in the market, we're noticing an increasing practice between software businesses around Javascript applications. Technologies such as ReactJS, NextJS, NodeJS, AWS, and MongoDB have been dominating the market. On the less tech-savvy side, there's another drift related to pre-built solutions like Shopify and WordPress. But, what should you pick?</p><p>Pre-built tools are a great way to kick off that small project you need to start running your company. The development time is fast, simple, and low cost. Most small business only requires a simple web page or e-commerce store. That's why it would be unreasonable to invest in more complex technologies. Honestly, Shopify and WordPress can get most of the job done. Shopify, for instance, saves a lot of resources related to software development, even though the plugin system ends up in the long term costing a lot of money. Shopify has an entire software as a service (SAAS) behind the scenes that will eventually display critical data to improve your business performance. Building such a system would cost thousands of dollars, and it wouldn't necessarily aggregate value to all e-commerce stores out there. An easy solution to dribble the limitations of Shopify is having a small team of software developers to code on top of the platform's existing code.</p><p>Despite these solutions being cheaper, you could also get it done yourself after a bit more practice. Unfortunately, all of those solutions have a limit. If you want to add a feature or layout that could be somehow complex, you'd have a hard time implementing it.</p><p>Now, if you're developing something more complex, like a mobile or web app, you should definitely consider using the MERN stack (MongoDB, Express, React, Node). Since Javascript has unified the Front-End and Back-End, the communication with different teams would be way easier and the onboarding of new talents as well. Why not use Python or another high-level tech out there to code these software?</p><p>Javascript does a good job at the Back-End and Front-End. Besides, frameworks like React Native allows using Javascript in other processes like Mobile development. Hence, making it easy to implement and expand the reach of a potential product. Also, Javascript is supported by a vast community and large corporations such as Facebook. Moreover, other languages like Ruby, Python, and Dart fail to reach the benefits of Javascript for Web and Mobile development.</p><p>We strongly suggest using a Javascript Framework that's compatible with your business operations. For example, if you're developing an e-commerce application, it'd be critical to use SEO-friendly technologies such as NextJS. So, before deciding if you are going to use Angular, React, Next, or Vue, be sure to check the pros and cons of each one.</p><p>Regardless of what technology you're using, have in mind to always research it in depth before consider using it. It's not because your team is most familiar with Python that you should also force a Web project with it. Technology evolves fast, and it's up to us to take advantage of it.</p>"
    },
    {
      "id": "how-to-stand-your-business-out-in-2021",
      "title": "How to stand your business out in 2021?",
      "date": "March 20, 2021",
      "imgSrc": "/image/article-20-03-2021.jpeg",
      "summary": "In 2020 the world shifted from a mix of physical and online to entirely digital. However, most of us have realized the internet has become extremely noisy",
      "content": "<p>In 2020 the world shifted from a mix of physical and online to entirely digital. However, most of us have realized the internet has become extremely noisy and polluted with cheap ads and thousands of businesses. So, how can we change the game to our side?</p><p>In this article, we will be targeting how we can stand out from the competition. If you're not already creating content on social ( TikTok, Youtube, LinkedIn ), I would highly recommend beginning! Acquiring traction in this digital market is only possible by achieving a position of guide in your industry.</p><p>First of all, you must have a website, and we don't mean a cheap WordPress or standard template Shopify Store with hard to read text. People are tired of looking over and over again at the same site structure, and it's time for a change. Otherwise, your online presence might be judged doubtful, or even worse a \"scam\".</p><p>Second of all, professionalism is key that bad User Experience has to go. We're in a time where we need to be practical. Moreover, we need to reduce the barriers that our clients have to go through to acquire our product. For example, if you're in the consulting or healthcare business, replace that old e-mail form with an actual calendar form! There're thousands of APIs out there, even free ones. Use them to your advantage!</p><p>Third of all, quality is a must-have. We can have the best product ever and the coolest looking website. If it's slow, we already lost. We can't express enough the importance of software development!  If your web or mobile application is consistently giving people a hard time, they'll not use it.</p><p>Last but not least, be straightforward!! The average user will look at your website for 5 seconds, can you believe it? 5 seconds! If at first glance it is not obvious what you do and how you do it, people will be confused and eventually close your site.</p><p>A first impression is everything in a digital world. Facebook pages and LinkedIn profiles can only do so much. We're in an era we need to bring value to clients even before they buy our product. If you own a small shop, create content on your website, social media, and have an amazing first impression. I bet it'll stand out from the crowd!</p>"
    },
    {
      "id": "what-is-front-end-and-back-end",
      "title": "What's Front and Back?",
      "date": "March 16, 2021",
      "imgSrc": "/image/article-front-vs-back.jpeg",
      "summary": "Since software development is a vast topic, we always use weird code names that segment software in specific fields",
      "content": "<p>What's the difference between Front-End and Back-End?</p><p>Since software development is a vast topic, we always use weird code names that segment software in specific fields. And that's why software development can get hard to get your head around!</p><p>We use terms like Front-End, Back-End, or Full-Stack to determine which area a programmer works. Translating to English, \"Font-End\" basically means that a developer works on the interactive part of the software where clients are directly in contact with, for example, a landing page. On the contrary,\"Back-End\" means someone that works on the \"back of the business\". The part the clients don't interact with, for instance, the database.</p><p>Confused already?</p><p>Honestly, software is just like a House! The architecture with the outstanding interior and amazing view is the interactive part of your house, Front-End, while the plumbing and heat is your Back-End. So, basically, the architects are the Front-End Developers while the Engineers are probably the Back-End programmers.</p><p>But, what about \"Full-Stack\"? It means someone is comfortable doing both! It may sound funny, but they are just like engineers that can decorate well!</p><p>You might be wondering, can they be extremely good at doing both parts? The simple answer is probably no. Full-Stack Developers might have a field of expertise since technologies vary drastically from one end to another. Some people feel more comfortable in the Back, others in the Front. But, honestly, they can get most of the job done when it comes to software development!</p><p>If you have in mind developing a large mobile or web application, I would definitely take into account the budget. Honestly, we would highly recommend hiring different specialists to deal with Front-End and Back-End. Even though Full-Stack developers may sound very attractive, they most often lack a deep understanding of both areas. It goes without saying, technology evolves quickly, and not all Full-Stacks out there maybe update with all the trends in both industries.</p><p>With all of that said, I hope we clarified a few points that you might need. Managing a technology team is no easy task. So, I wish you the best of luck in your journey of entrepreneurship and software development! Keep following our blog for more handy insights!</p>"
    }
  ]
}