{
  "id": "what-technologies-should-you-be-using",
  "title": "What technologies should you use?",
  "date": "March 26, 2021",
  "imgSrc": "/image/article-26-03-2021.jpeg",
  "content": "<p>Doesn't matter if you are in health tech, fintech, e-commerce, or blockchain. There'll be a time you will need to define what technology you will use to build your business. Following trends and superficial advices might cost you thousands of dollars later on. So, which one should you pick?</p><p>Currently, in the market, we're noticing an increasing practice between software businesses around Javascript applications. Technologies such as ReactJS, NextJS, NodeJS, AWS, and MongoDB have been dominating the market. On the less tech-savvy side, there's another drift related to pre-built solutions like Shopify and WordPress. But, what should you pick?</p><p>Pre-built tools are a great way to kick off that small project you need to start running your company. The development time is fast, simple, and low cost. Most small business only requires a simple web page or e-commerce store. That's why it would be unreasonable to invest in more complex technologies. Honestly, Shopify and WordPress can get most of the job done. Shopify, for instance, saves a lot of resources related to software development, even though the plugin system ends up in the long term costing a lot of money. Shopify has an entire software as a service (SAAS) behind the scenes that will eventually display critical data to improve your business performance. Building such a system would cost thousands of dollars, and it wouldn't necessarily aggregate value to all e-commerce stores out there. An easy solution to dribble the limitations of Shopify is having a small team of software developers to code on top of the platform's existing code.</p><p>Despite these solutions being cheaper, you could also get it done yourself after a bit more practice. Unfortunately, all of those solutions have a limit. If you want to add a feature or layout that could be somehow complex, you'd have a hard time implementing it.</p><p>Now, if you're developing something more complex, like a mobile or web app, you should definitely consider using the MERN stack (MongoDB, Express, React, Node). Since Javascript has unified the Front-End and Back-End, the communication with different teams would be way easier and the onboarding of new talents as well. Why not use Python or another high-level tech out there to code these software?</p><p>Javascript does a good job at the Back-End and Front-End. Besides, frameworks like React Native allows using Javascript in other processes like Mobile development. Hence, making it easy to implement and expand the reach of a potential product. Also, Javascript is supported by a vast community and large corporations such as Facebook. Moreover, other languages like Ruby, Python, and Dart fail to reach the benefits of Javascript for Web and Mobile development.</p><p>We strongly suggest using a Javascript Framework that's compatible with your business operations. For example, if you're developing an e-commerce application, it'd be critical to use SEO-friendly technologies such as NextJS. So, before deciding if you are going to use Angular, React, Next, or Vue, be sure to check the pros and cons of each one.</p><p>Regardless of what technology you're using, have in mind to always research it in depth before consider using it. It's not because your team is most familiar with Python that you should also force a Web project with it. Technology evolves fast, and it's up to us to take advantage of it.</p>"
}